{
    "records": [
        {
            "id": 1,
            "name": "Арочное заполнение",
            "desc": "Может принимать значения 'Да' и 'Нет'. Определяет применение комплектующего в случае арочного проема или НЕ арочного."
        },
        {
            "id": 2,
            "name": "Артикул заполнения по умолчанию",
            "desc": ""
        },
        {
            "id": 3,
            "name": "Артикул створки",
            "desc": "Позволяет выбрать умолчально задаваемый артикул створки на каждой из сторон створки. Не является обязательным параметром"
        },
        {
            "id": 4,
            "name": "Бригада (участок)",
            "desc": "может принимать значения, предварительно описанные в соответствующем каталоге 'Бригады'. Используется для указания, какой бригаде или отделу принадлежат человеко-часы, затраченные на выполнение данного варианта соединения. Необходимо использовать в паре с параметром 'Трудозатраты, ч/'"
        },
        {
            "id": 5,
            "name": "Вариант соединения для стойки",
            "desc": ""
        },
        {
            "id": 6,
            "name": "Вид L-образного варианта",
            "desc": "обеспечивает возможность разделения простых (сопряжение 2-х профилей) и крестовых (сопряжение 3-х) соединений для разделения их спецификаций"
        },
        {
            "id": 7,
            "name": "Вид Т-образного варианта",
            "desc": "Обеспечивает возможность разделения 'Простых' (сопряжение 2-х профилей) и 'Крестовых' (сопряжение 3-х) соединений для разделения их спецификаций, а также 'Сложных Y-образных' - для разделения прямых крестовых вариантов соединений и сложных креплений в одном узле типа 'солнышко' в арке"
        },
        {
            "id": 8,
            "name": "Внешнее соединение",
            "desc": "Служит для выбора конкретного варианта применения соединения профилей только для внешних (расположенных по периметру изделия) или только для внутренних (расположенных в теле изделия) соединений. Применяется в случае необходимости использовать конкретное соединение профилей либо по периметру, либо внутри изделия."
        },
        {
            "id": 9,
            "name": "Внутренняя текстура равна внешней",
            "desc": ""
        },
        {
            "id": 10,
            "name": "Воздухопроницаемость, м3/(ч*м2",
            "desc": ""
        },
        {
            "id": 11,
            "name": "Возможное управление жалюзи",
            "desc": ""
        },
        {
            "id": 12,
            "name": "Выбран авто расчет подвеса",
            "desc": "При указании значения 'Да' включает автоматический подбор петель по текстуре изделия. Работает только при полном совпадении текстур петель и текстур изделия"
        },
        {
            "id": 13,
            "name": "Высота заполнения, мм",
            "desc": "Позволяет задать фиксированную высоту комплектующего"
        },
        {
            "id": 14,
            "name": "Высоту сделать длиной",
            "desc": "Позволяет учитывать высоту контура в качестве длины комплектующего"
        },
        {
            "id": 15,
            "name": "Диапазон веса створки, кг",
            "desc": "Определяет диапазон веса створки допустимый для конкретного комплектующего. Вес створки определяется по весу заполнения, рассчитанного по габаритам створки"
        },
        {
            "id": 16,
            "name": "",
            "desc": "Диапазон веса, кг  - определяет диапазон веса створки допустимый для конкретного комплектующего. Вес створки определяется по весу заполнения, рассчитанного по габаритам створки."
        },
        {
            "id": 17,
            "name": "Диапазон высоты вариационной ручки, мм",
            "desc": ""
        },
        {
            "id": 18,
            "name": "Диапазон макс. ширины откоса, мм",
            "desc": ""
        },
        {
            "id": 19,
            "name": "Диапозон веса заполнения, кг",
            "desc": ""
        },
        {
            "id": 20,
            "name": "Длина Артикула 1, мм",
            "desc": "Позволяет ограничить диапазоном значений подбор механических соединителей для вариантов 'импост-коробка' в зависимости от длины импоста"
        },
        {
            "id": 21,
            "name": "Длина округляется с шагом, мм",
            "desc": "Округление рассчитанной длины с определенным шагом. Подбирается ближайшее меньшее значение"
        },
        {
            "id": 22,
            "name": "Длина подбирается из списка, мм",
            "desc": "Для подбора длины комплектующего из списка определенного в значении параметра. Подбирается ближайшая меньшая длина из списка"
        },
        {
            "id": 23,
            "name": "Длина, мм",
            "desc": "в случае указания величины - явное задание длины комплектующего, без привязки к длине комплекта. Для корректного расчета комплектующих в нескольких комплектах, необходимо использовать формулу 'L+n', где - 'n' - поправка для точного расчета длины заготовки. - позволяет задать определенную (фиксированную) длину комплектующего, а не использовать по умолчанию длину профиля, на который устанавливается состав"
        },
        {
            "id": 24,
            "name": "Для Артикула 1 указан состав",
            "desc": "Значением является значение поля 'Наименование состава' или его часть (в каталоге Конструктив - Составы). Является проверочным для применения конкретного варианта соединения, если значение параметра для Артикула 1 (Артикула 2) действительно используется в Составах с тем же значением"
        },
        {
            "id": 25,
            "name": "Для Артикула 2 указан состав",
            "desc": "Значением является значение поля 'Наименование состава' или его часть (в каталоге Конструктив - Составы). Является проверочным для применения конкретного варианта соединения, если значение параметра для Артикула 1 (Артикула 2) действительно используется в Составах с тем же значением"
        },
        {
            "id": 26,
            "name": "Для Артикулов не указан состав",
            "desc": "Работает аналогично предыдущему параметру, но обратным образом"
        },
        {
            "id": 27,
            "name": "Для Артикулов указан состав",
            "desc": ""
        },
        {
            "id": 28,
            "name": "Для варианта соединения Т (*)",
            "desc": ""
        },
        {
            "id": 29,
            "name": "Для внешнего/внутреннего угла плоскости, °",
            "desc": "Определяет сочетания значений внешних и внутренних углов плоскостей. Символ - @ - определяет наличие зеркальной проверки. Допускается задание диапазонов значений углов"
        },
        {
            "id": 30,
            "name": "Для технологического кода контейнера",
            "desc": "Используется для определения применимости Состава в зависимости от технологического кода контейнера. ТК определяется в МЦ"
        },
        {
            "id": 31,
            "name": "Для технологического кода контейнера (1/2)",
            "desc": "Позволяет указать технологические коды для контейнеров Артикула 1 и Артикула 2. Синтаксис строки: Z45/F58 - проверка наличия технологического кода Z45для профиля Артикула 1 и проверка наличия технологического кода F58 для профиля Артикула 2; */F58 - проверка наличия технологического кода F58 только для профиля Артикула 2"
        },
        {
            "id": 32,
            "name": "Для типа открывания",
            "desc": "Проверочный параметр со значениями: [фрамуга, поворотное, поворотно-откидное], позволяющий установить данный вариант соединения в зависимости от типа применяемой фурнитуры, створка которой входит в данное соединение"
        },
        {
            "id": 33,
            "name": "Доп.обработки (;)",
            "desc": ""
        },
        {
            "id": 34,
            "name": "Доп.основная обработка (;)",
            "desc": ""
        },
        {
            "id": 35,
            "name": "Доп.симметр. обработка (;)",
            "desc": ""
        },
        {
            "id": 36,
            "name": "Допустимое соотношение габаритов (б/м)",
            "desc": "Является проверочным параметром соотношения габаритов (большой/малый), - для использования совместно с полем 'Наценки, %'. Параметр допускает указание диапазона соотношений - например '5-18'"
        },
        {
            "id": 37,
            "name": "Допустимый угол между плоскостями, °",
            "desc": "Определяет диапазон углов между плоскостями конструкции для применения данного Состава. Допускается указание как конкретного угла, так и диапазона значений углов"
        },
        {
            "id": 38,
            "name": "Если артикул профиля контура",
            "desc": "Может принимать значение любого артикула профиля. Проверяется наличие указанного артикула в контуре створки"
        },
        {
            "id": 39,
            "name": "Если артикул профиля контура",
            "desc": "Может принимать значение любого артикула профиля. Методом выбора из выпадающего списка артикулов МЦ типа Профиль. Проверяет наличие указанного артикула в контуре в которое установлено Заполнение"
        },
        {
            "id": 40,
            "name": "Если артикул створки",
            "desc": "Проверочный параметр, позволяющий установить комплектующий, к которому относиться в случае выполнения условия параметра для профиля створки, исключая профиль цоколя"
        },
        {
            "id": 41,
            "name": "Если артикул цоколя",
            "desc": "Проверочный параметр, позволяющий установить комплектующий, к которому относиться в случае выполнения условия параметра для профиля цоколя"
        },
        {
            "id": 42,
            "name": "Если высота ручки",
            "desc": "Может иметь следующие значения: 'по середине' - ручка устанавливается по середине профиля створки; 'константная' - происходит проверка списка комплектующих совместно с параметром 'Ручка от низа створки, мм'; 'не константная' - запрет на применение основных запоров с константным положением ручки; 'установлена' - происходит проверка списка комплектующих совместно с параметром 'Мин. высота ручки, мм' ('Макс. высота ручки, мм')"
        },
        {
            "id": 43,
            "name": "Если два присоединенных артикула",
            "desc": "Позволяет указать 2 артикула при наличии соединения с которыми устанавливается пункт Спецификации Состава. Возможно указание с помощью интерфейса программы - выбор первого, а затем второго артикула. Или ручное указание артикулов, через точку с запятой"
        },
        {
            "id": 44,
            "name": "Если номер стороны в контуре",
            "desc": "Проверочный параметр для альтернативной настройки водосливов и подставочных профилей в непрямоугольных контурах"
        },
        {
            "id": 45,
            "name": "Если предыдущий артикул",
            "desc": "Позволяет установку состава в случае совпадения предыдущего (по ходу обхода векторов профилей изделия (против часовой стрелки)) артикула профиля с профилем, на который устанавливается состав. Параметр содержит выпадающий список артикулов профилей"
        },
        {
            "id": 46,
            "name": "Если признак системы конструкции",
            "desc": "Позволяет определить в качестве значения параметра значения полей 'Признак системы' окна 'Системы конструкци"
        },
        {
            "id": 47,
            "name": "Если признак состава",
            "desc": "Для применения элемента Спецификации при применении Состава с определенным признаком состава"
        },
        {
            "id": 48,
            "name": "Если признак состава",
            "desc": "Для применения элемента Спецификации при применении Состава с определенным признаком состава"
        },
        {
            "id": 49,
            "name": "Если признак состава Арт.1 ('Если признак состава Арт. 2')",
            "desc": "Проверяет значения поля 'Признак' у Составов профилей Артикула 1 и 2"
        },
        {
            "id": 50,
            "name": "Если признак состава Арт.2 ('Если признак состава Арт.1')",
            "desc": "Проверяет значения поля 'Признак' у Составов профилей Артикула 1 и 2"
        },
        {
            "id": 51,
            "name": "Если прилегающий артикул",
            "desc": "Может принимать значение любого артикула профиля. Имеется в виду артикул, касающийся профиля, на который устанавливается состав. Для прилегающих соединений"
        },
        {
            "id": 52,
            "name": "Если профиль",
            "desc": "Имеет значения 'Прямой' и 'Кривой' используется для оценки кривизны профиля (наличия радиуса) для возможности разделения спецификаций прямых и кривых (изогнутых)"
        },
        {
            "id": 53,
            "name": "Если серия створки",
            "desc": "Проверочный параметр, позволяющий ограничить установку комплектующего в случае, если серия створки, но которую устанавливается фурнитура, совпадает со значением, указанным для этого параметра"
        },
        {
            "id": 54,
            "name": "Если следующий артикул",
            "desc": "Позволяет установку состава в случае совпадения следующего (по ходу обхода векторов профилей изделия (против часовой стрелки)) артикула профиля с профилем, на который устанавливается состав. Параметр содержит выпадающий список артикулов профилей"
        },
        {
            "id": 55,
            "name": "Если соединенный артикул (T-обр.)",
            "desc": "Может принимать значение любого артикула профиля. Имеется в виду артикул, касающийся профиля, на который устанавливается состав. Для Т-соединений"
        },
        {
            "id": 56,
            "name": "Если створка прилегает к артикулу",
            "desc": ""
        },
        {
            "id": 57,
            "name": "Если створка фурнитуры",
            "desc": ""
        },
        {
            "id": 58,
            "name": "Если стойка удлинена",
            "desc": "Для учета в спецификации элемента в зависимости от наличия удлинения стойки или при его отсутствии"
        },
        {
            "id": 59,
            "name": "Если текстура профиля Арт.1",
            "desc": ""
        },
        {
            "id": 60,
            "name": "Если ширина комплекта, мм",
            "desc": ""
        },
        {
            "id": 61,
            "name": "Задать Угол_реза_1/Угол_реза_2, °",
            "desc": "Используется при необходимости задания угла реза профиля, отличного используемый в параметре 'Углы реза'. При этом необходимо помнить, что нумерация углов идет от левого нижнего угла изделия и далее против часовой стрелки и относится к профилям изделия"
        },
        {
            "id": 62,
            "name": "Зазор_на_метр_мм/Размер терморазрыва стойки, мм",
            "desc": "Позволяет задать алгоритм учета термозазора при установленном параметре 'Разбиение профиля по уровням'. 'зазор_На_метр_мм' - позволяет задать количество в мм зазора в зависимости от длины отрезка стойки. Обычно это 1 мм на каждый метр длины стойки. 'Размер терморазрыва стойки, мм' - задает константное значение зазора, вне зависимости от длин стоек. Примеры синтаксиса: 0/4 - задан константный зазор 4 мм; 1/0 - задан рассчитываемый зазор - 1 мм на каждый метр стойки"
        },
        {
            "id": 63,
            "name": "Замок от края профиля, мм",
            "desc": ""
        },
        {
            "id": 64,
            "name": "Заполнение типа",
            "desc": "Позволяет указать один или несколько подтипов МЦ в качестве значения проверочного параметра"
        },
        {
            "id": 65,
            "name": "Заполнения одинаковой толщины",
            "desc": "Является проверочным. Состав, к которому указан данный параметр со значением 'Да', будет установлен, если толщина внутреннего и внешнего заполнения равна. Таким образом, проходит проверка примыкающих к профилю заполнений для разделения составов с доборными элементами или без"
        },
        {
            "id": 66,
            "name": "Звукоизоляция, дБА",
            "desc": ""
        },
        {
            "id": 67,
            "name": "Изменение сторон покраски",
            "desc": "В случае установки значения 'Да' присваивает внешней текстуре профиля значение внутренней текстуры изделия и наоборот. Применяется для корректного отображения текстур коробок дверей открывания наружу, а так же для профилей штульпа. применяется не только при покраске, но и при ламинации"
        },
        {
            "id": 68,
            "name": "Код обработки (;)",
            "desc": "Предназначен для определения команд управления для автоматических обрабатывающих центров"
        },
        {
            "id": 69,
            "name": "Код обработки",
            "desc": "Применяется для параметризации для выгрузок на обрабатывающие центры. в частности для задания обработки фрезерования водоотводящих каналов, фрезерования отверстий под замки и пр."
        },
        {
            "id": 70,
            "name": "Код основной обработки (;)",
            "desc": ""
        },
        {
            "id": 71,
            "name": "Код системы содержит строку",
            "desc": "Если код системы (см. Модели-=>Системы=>Перв.вкладка=>Код системы) содержит строку"
        },
        {
            "id": 72,
            "name": "Коды внешн. текстуры изделия",
            "desc": "Проверка соответствия кодов внешней текстуры изделия. Возможно задание диапазонов кодов текстур"
        },
        {
            "id": 73,
            "name": "Коды внешн. текстуры изделия",
            "desc": "Может принимать значения внешней текстуры изделия. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения указанных в параметре текстур с текстурами изделия"
        },
        {
            "id": 74,
            "name": "Коды внутренней и внешней текстуры изделия",
            "desc": "Может принимать значения внутренней и внешней текстуры изделия. Соответственно, состав, имеющий"
        },
        {
            "id": 75,
            "name": "Коды внут. или внеш. текстуры изд.",
            "desc": "Может принимать значения внутренней или внешней текстуры изделия. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения одной из текстур с текстурами изделия"
        },
        {
            "id": 76,
            "name": "Коды внутр. текстуры изделия",
            "desc": "Проверка соответствия кодов внутренней текстуры изделия. Возможно задание диапазонов кодов текстур"
        },
        {
            "id": 77,
            "name": "Коды внутр. текстуры изделия",
            "desc": "Может принимать значения внутренней текстуры изделия. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения указанных в параметре текстур с текстурами изделия"
        },
        {
            "id": 78,
            "name": "Коды основной текстуры изделия",
            "desc": "Проверка соответствия кодов основной текстуры изделия. Возможно задание диапазонов кодов текстур;  - может принимать значения основной текстуры изделия. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения указанной в параметре текстуры с текстурой изделия"
        },
        {
            "id": 79,
            "name": "Коды основной текстуры изделия",
            "desc": "Может принимать значения основной текстуры изделия. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения указанной в параметре текстуры с текстурой изделия"
        },
        {
            "id": 80,
            "name": "Коды основной текстуры контейнера",
            "desc": "Может принимать значения основной текстуры того профиля, который является контейнером для профиля, на который устанавливается состав. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения указанной в параметре текстуры с текстурой профиля контейнера, а не профиля, на который устанавливается состав"
        },
        {
            "id": 81,
            "name": "Коды внутр. текстуры контейнера",
            "desc": "Может принимать значения внутренней текстуры того профиля, который является контейнером для профиля, на который устанавливается состав. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения указанной в параметре текстуры с текстурой профиля контейнера, а не профиля, на который устанавливается состав"
        },
        {
            "id": 82,
            "name": "Коды внешн. текстуры контейнера",
            "desc": "Может принимать значения внешней текстуры того профиля, который является контейнером для профиля, на который устанавливается состав. Соответственно, состав, имеющий ограничением данный параметр, будет установлен в случае совпадения указанной в параметре текстуры с текстурой профиля контейнера, а не профиля, на который устанавливается состав"
        },
        {
            "id": 83,
            "name": "Коды текстуры подвеса",
            "desc": "Может принимать значения основных текстур петель. Соответственно, комплектующее, имея ограничением данный параметр, будет установлен в случае совпадения указанного в параметре цвета с цветом петель"
        },
        {
            "id": 84,
            "name": "Коды текстуры ручки",
            "desc": "Может принимать значения основных текстур ручки. Соответственно, комплектующее, имея ограничением данный параметр, будет установлен в случае совпадения указанного в параметре цвета с цветом ручки. Действие автоподбора текстуры ручки расширено на зависимую и вложенную спецификаци"
        },
        {
            "id": 85,
            "name": "Коды текстуры створки",
            "desc": "Может принимать значения основных текстур створки. Соответственно, комплектующее, имея ограничением данный параметр, будет установлен в случае совпадения указанного в параметре цвета с цветом створки. Действие автоподбора текстуры створки расширено на зависимую и вложенную спецификаци"
        },
        {
            "id": 86,
            "name": "Количество",
            "desc": "Используется для задания достаточного минимума какого-либо комплектующего. Параметр также может быть приравнен нулю для расчета по параметрам 'Шаг, мм' и 'Количество на шаг' . В случае не указания значения этого параметра количество комплектующих принимается равным единице. При расчете по параметрам 'Шаг, мм' и 'Количество на шаг', это ведет к неверному увеличению реального количества на количество одной единицы комплектующего"
        },
        {
            "id": 87,
            "name": "Количество на шаг",
            "desc": " - в случае не указания значения этого параметра количество комплектующих принимается равным единице. При расчете по параметрам 'Шаг, мм' и 'Количество на шаг', это ведет к неверному увеличению реального количества на количество одной единицы комплектующего"
        },
        {
            "id": 88,
            "name": "Комплект одно текстурный",
            "desc": ""
        },
        {
            "id": 89,
            "name": "Контейнер имеет тип",
            "desc": "Служит для присвоения принадлежности артикулу, входящему в состав, какому-либо контейнеру (Контейнер - любой отдельный видимый элемент на чертеже) для уникализации состава путем задания конкретных значений или перечня значений. Возможно задание диапазона значений: 1-'коробка', 2-'створка', 3-'импост', 4-'ригель/импост', 5-'стойка', 6-'стойка/коробка, 7-'эркер', 8-'грань'"
        },
        {
            "id": 90,
            "name": "Контейнер имеет тип Артикула1/Артикула2",
            "desc": "Служит для присвоения принадлежности Артикулу 1(Артикулу 2), входящему в соединение, какому либо контейнеру (контейнер - любой отдельный видимый элемент на чертеже): Коробка, створка, импост, стойка и пр. Примеры синтаксиса значения параметра: '1/3' - контейнер Артикула 1 имеет тип коробка, а контейнер Артикула 2 - тип импост; */3 - контейнер Артикула 1 не проверяется, контейнер Артикула 2 имеет тип импост"
        },
        {
            "id": 91,
            "name": "Контейнер типа",
            "desc": "Служит для присвоения принадлежности артикулу, входящему в состав, какому-либо контейнеру (Контейнер - любой отдельный видимый элемент на чертеже) для уникализации состава путем задания конкретных значений или перечня значений. Возможно задание диапазона значений: 1-'коробка', 2-'створка', 3-'импост', 4-'ригель/импост', 5-'стойка', 6-'стойка/коробка, 7-'эркер', 8-'грань'"
        },
        {
            "id": 92,
            "name": "Коэффициент пропускания света",
            "desc": "Позволяет ввести значение коэффициента пропускания света. Значение параметра можно использовать в отчетах, для вывода справочной информации"
        },
        {
            "id": 93,
            "name": "Коэффициент_расхода",
            "desc": ""
        },
        {
            "id": 94,
            "name": "Коэффициенты АКЦИИ",
            "desc": ""
        },
        {
            "id": 95,
            "name": "Максимальное заполнение изделия, мм",
            "desc": "Используется для задания максимальной толщины заполнения изделия"
        },
        {
            "id": 96,
            "name": "Максимальный размер шва, мм",
            "desc": "Проверяет длину торца импоста в шве соединения с коробкой и если длина торца превышает значение, указанное в параметре, то такой вариант соединения не может быть использован. Используется для проверки наклонных импостов"
        },
        {
            "id": 97,
            "name": "На прилегающей створке",
            "desc": ""
        },
        {
            "id": 98,
            "name": "Набрать_длину_с_нахлестом, мм",
            "desc": ""
        },
        {
            "id": 99,
            "name": "Набрать_длину_с_нахлестом/Длина , мм",
            "desc": ""
        },
        {
            "id": 100,
            "name": "Надпись на элементе",
            "desc": "Выводит в режиме проектирования бирку, прикрепленную к данному соединению с текстовой надписью, внесенной в значение параметра"
        },
        {
            "id": 101,
            "name": "Надпись на эскизе",
            "desc": ""
        },
        {
            "id": 102,
            "name": "Название фурнитуры содержит",
            "desc": "Применяется для назначения Состава только при наличии в названии фурнитуры определенного набора символов. Значением является набор символов"
        },
        {
            "id": 103,
            "name": "Направление открывания",
            "desc": ""
        },
        {
            "id": 104,
            "name": "Номер Стороны_(X)/Стороны_(Y) набора",
            "desc": ""
        },
        {
            "id": 105,
            "name": "Номер поверхности",
            "desc": ""
        },
        {
            "id": 106,
            "name": "Номер стороны",
            "desc": ""
        },
        {
            "id": 107,
            "name": "Номер стороны по параметру набора",
            "desc": ""
        },
        {
            "id": 108,
            "name": "Ограничение высоты ручки, мм",
            "desc": ""
        },
        {
            "id": 109,
            "name": "Ограничение габарита контура, мм",
            "desc": "Используется для ограничения применения соединения при габарите контура менее или более указанного. Возможно задание диапазона значений"
        },
        {
            "id": 110,
            "name": "Ограничение длины (ручка вариацион.), мм",
            "desc": ""
        },
        {
            "id": 111,
            "name": "Ограничение длины (ручка константа), мм",
            "desc": ""
        },
        {
            "id": 112,
            "name": "Ограничение длины (ручка по середине), мм",
            "desc": ""
        },
        {
            "id": 113,
            "name": "Ограничение длины профиля, мм",
            "desc": "Задает значение диапазона длин для профиля, на который данный состав может быть установлен"
        },
        {
            "id": 114,
            "name": "Ограничение длины стороны, мм",
            "desc": ""
        },
        {
            "id": 115,
            "name": "Ограничение площади, кв.м.",
            "desc": "Является ограничивающим условием для установки того состава, к которому относится, по габаритам контура проема. М.б. задан диапазон значений"
        },
        {
            "id": 116,
            "name": "Ограничение угла к горизонту, °",
            "desc": "Устанавливает граничное условие на использование конкретного варианта соединения профилей. При угле наклона к горизонту менее или более указанного, для выбранного варианта соединений профилей, конкретный вариант соединения профилей использован не будет. Возможно указание диапазона углов к горизонту, например 0-180"
        },
        {
            "id": 117,
            "name": "Ограничение угла к горизонту",
            "desc": "Ставит граничное условие на использование конкретного варианта соединения профилей. При угле наклона к горизонту отличном от указанного, для выбранного состава профилей, конкретный состав профилей использован не будет. Возможно как указание конкретного угла, так и задание диапазона или нескольких диапазонов"
        },
        {
            "id": 118,
            "name": "Ограничение угла, °",
            "desc": "Ограничение угла между профилями. Применяется для использования конкретного варианта соединения профилей в случае соответствия указанному значению"
        },
        {
            "id": 119,
            "name": "Ограничение ширины/высоты листа, мм",
            "desc": "Является ограничивающим условием для установки того состава, к которому относится, по габаритам контура проема. М.б. задан диапазон размеров, а так же введена зеркальная проверка"
        },
        {
            "id": 120,
            "name": "Округлять количество до ближайшего",
            "desc": ""
        },
        {
            "id": 121,
            "name": "Ориентация Артикула1/Артикула2, °",
            "desc": "Используется в случае необходимости задать угол для Артикула 1 и/или Артикула 2 как обязательное условие для использования конкретного варианта соединения профилей. Возможно задание диапазонов значений углов"
        },
        {
            "id": 122,
            "name": "Ориентация стороны, °",
            "desc": ""
        },
        {
            "id": 123,
            "name": "От ручки не менее, мм",
            "desc": ""
        },
        {
            "id": 124,
            "name": "Отправочная марка фасада",
            "desc": ""
        },
        {
            "id": 125,
            "name": "Отступ для Артикула1/Артикула2, мм",
            "desc": "Позволяет указать величину смещения для профиля в данном соединении. Например, используется для совмещения в алюминии в усовом соединении камер профиля импоста и коробки путем смещения импоста в соединении на величину пера импоста (верхний правый угол штульповой створки в стандартной 2-х створчатой двери, активная створка - слева)."
        },
        {
            "id": 126,
            "name": "Периметр покраски по периметру",
            "desc": ""
        },
        {
            "id": 127,
            "name": "Периметр покраски, мм",
            "desc": ""
        },
        {
            "id": 128,
            "name": "Петля от верха створки, мм",
            "desc": "Используется совместно с коллегиальным описанием стороны 'крепление петель' вкладки 'Список фурнитуры', установленного флага 'Установочные размеры до петель' в 'Настройках' - 'Графических настройках' и задает фиксированную высоту петли от верха створки при ее графической прорисовке в режиме проектирования"
        },
        {
            "id": 129,
            "name": "Петля от низа створки, мм",
            "desc": "Используется совместно с коллегиальным описанием стороны 'крепление петель' вкладки 'Список фурнитуры', установленного флага 'Установочные размеры до петель' в 'Настройках' - 'Графических настройках' и задает фиксированную высоту петли от низа створки при ее графической прорисовке в режиме проектирования"
        },
        {
            "id": 130,
            "name": "Петля по центру стороны",
            "desc": "Используется совместно с коллегиальным описанием стороны 'крепление петель'вкладки 'Список фурнитуры', установленного флага 'Установочные размеры до петель' в 'Настройках' - 'Графических настройках' и задает высоту петли как половину длины стороны створки при ее графической прорисовке в режиме проектирования"
        },	
        {
            "id": 131,
            "name": "Подбор дистанционных вставок по пролетам",
            "desc": "Автоматический подбор МЦ с подтипом 'дистанционер фасада' по толщине, с учетом эффективного заполнения"
        },	
        {
            "id": 132,
            "name": "Подбор дистанционных вставок пролета",
            "desc": ""
        },	
        {
            "id": 133,
            "name": "Поперечину ставить :",
            "desc": ""
        },	
        {
            "id": 134,
            "name": "Поправка в спецификацию, мм",
            "desc": "Предназначен для внесения поправки в Спецификацию для данного профиля"
        },	
        {
            "id": 135,
            "name": "Поправка габарита накладки, мм",
            "desc": "Для формирования дублирующего эскиза изделия по габаритам алюминиевых накладок систем Wood+AL. Параметр задает поправку в мм от габаритов профилей коробок до габаритов накладок"
        },	
        {
            "id": 136,
            "name": "Поправка для состава Арт.1/Арт.2 , мм",
            "desc": ""
        },	
        {
            "id": 137,
            "name": "Разбиение профиля по уровням",
            "desc": "Позволяет при установке в режиме проектирования отметок высот разбиения рассечь на этих высотах профили состава, включая образующий профиль и указать параметризованную спецификацию в месте рассечения при значении параметра - 'Да'. Значение параметра 'Нет' НЕ рассекает ни профили состава, ни образующий профиль даже при прохождении уровня деления, но позволяет указать параметризованную спецификацию на высотах разбиения. 'АВТО' - состав устанавливается всегда, при наличии уровней разделения стойки по смыслу 'Да'."
        },	
        {
            "id": 138,
            "name": "Поправка для состава, мм",
            "desc": ""
        },	
        {
            "id": 139,
            "name": "Поправка на стороны четные/нечетные, мм",
            "desc": "Используется для введения поправки относительно заполнения, на которое она устанавливается, на указанную величину. Значения параметра может принимать как положительное, так и отрицательное значение. При положительном значении поправки величина поправки добавляется к габариту заполнения, на который устанавливается состав. При отрицательном значении - поправка вычитается"
        },	
        {
            "id": 140,
            "name": "Поправка не прямого угла импоста, мм",
            "desc": "Добавочная поправка, складываемая по двум '-обр.' соединениям не под 90° - первого и второго концов импоста. Значения параметра может принимать как положительное, так и отрицательное значение. При положительном значении поправки величина поправки добавляется к длине профиля, на который устанавливается состав. При отрицательном значении - поправка вычитается"
        },	
        {
            "id": 141,
            "name": "Поправка по нормали от начала/конца, мм",
            "desc": ""
        },
        {
            "id": 142,
            "name": "Поправка ширины/высоты, мм",
            "desc": "Служит для изменения длины комплектующего относительно профиля, на который он устанавливается, на указанную величину. Значения параметра может принимать как положительное, так и отрицательное значение. При положительном значении поправки величина поправки добавляется к длине профиля, на который устанавливается состав. При отрицательном значении - поправка вычитается"
        },	
        {
            "id": 143,
            "name": "Поправка, мм",
            "desc": "Служит для изменения длины комплектующего относительно контейнера, в который оно устанавливается, на указанную величину. Значения параметра может принимать как положительное, так и отрицательное значение. При положительном значении поправки величина поправки добавляется к длине контейнера, на который устанавливается состав. При отрицательном значении - поправка вычитается"
        },	
        {
            "id": 144,
            "name": "Порог расчета, мм",
            "desc": "Задает отступ по длине, где действует параметр 'Количество' для расчета минимального количества комплектующих и не действуют параметры 'Шаг, мм' и 'Количество на шаг'"
        },	
        {
            "id": 145,
            "name": "Правило подбора текстур",
            "desc": "Предназначен для переназначения текстур профиля в соответствии заданным правилам. Правила задаются значениями параметра"
        },	
        {
            "id": 146,
            "name": "Правильная полуарка",
            "desc": ""
        },	
        {
            "id": 147,
            "name": "Прилегание контура створки",
            "desc": ""
        },	
        {
            "id": 148,
            "name": "Применять коэффициенты АКЦИИ для МЦ",
            "desc": ""
        },	
        {
            "id": 149,
            "name": "Припуск Артикула 1, мм.",
            "desc": "Позволяет указать величину припуска (удлинения) профиля в данном соединении. Используется, например, для указания припуска на сварку для ПВХ: размер изделия на эскизе 1000х1000 мм, при указании припуска артикула коробки 2,5 мм размер профиля коробки в спецификации изделия и в карте раскроя будет 1005 мм. В качестве величины припуска берется величина удлинения профиля в данном соединении. Опция 'Припуск сварного угла' применяется для указания в качестве величины припуска нормали к плоскости отреза профиля, а не удлинения профиля. Используется совместно с параметром 'Припуск Артикула 1, мм'. При установке флага этой опции, в качестве величины припуска берется величина нормали к плоскости отреза профиля"
        },	
        {
            "id": 150,
            "name": "Припуск Артикула1/Артикула2 , мм",
            "desc": "Позволяет указать величину припуска (удлинения) профиля в данном соединении. Используется, например, для указания припуска на сварку для ПВХ: размер изделия на эскизе 1000х1000 мм, при указании припуска артикула коробки 2,5 мм размер профиля коробки в спецификации изделия и в карте раскроя будет 1005 мм. В качестве величины припуска берется величина удлинения профиля в данном соединении. Опция 'Припуск сварного угла' применяется для указания в качестве величины припуска нормали к плоскости отреза профиля, а не удлинения профиля. Используется совместно с параметром 'Припуск Артикула 1, мм'('Припуск Артикула 2, мм'). При установке флага этой опции, в качестве величины припуска берется величина нормали к плоскости отреза профиля"
        },	
        {
            "id": 151,
            "name": "Проверять Cторону_(L)/Cторону_(W)",
            "desc": ""
        },		
        {
            "id": 152,
            "name": "Продолжение общей арки",
            "desc": "Применяется для расчета общей длины двух арочных профилей. Используется для варианта соединения двух арочных профилей створки или коробки, имеющих одинаковые артикул, текстуру, радиус и центр окружности"
        },
        {
            "id": 153,
            "name": "Проходит уровень деления",
            "desc": "Проверка, что через профиль проходит уровень деления"
        },
        {
            "id": 154,
            "name": "Радиус, мм",
            "desc": ""
        },
        {
            "id": 155,
            "name": "Разбиение профиля по уровням",
            "desc": "Позволяет при установке в режиме проектирования отметок высот разбиения рассечь на этих высотах профили состава, включая образующий профиль и указать параметризованную спецификацию в месте рассечения при значении параметра - 'Да'. Значение параметра 'Нет' НЕ рассекает ни профили состава, ни образующий профиль даже при прохождении уровня деления, но позволяет указать параметризованную спецификацию на высотах разбиения. 'АВТО' - состав устанавливается всегда, при наличии уровней разделения стойки по смыслу 'Да'"
        },
        {
            "id": 156,
            "name": "Размер от края пакета, мм",
            "desc": "Позволяет указать величину усечения Артикула 1 в конкретном Т-образном соединении. Например: для описания усечения раскладки в стеклопакете, когда раскладка описывается как импост"
        },
        {
            "id": 157,
            "name": "Размер, мм",
            "desc": "Применяется для указания смещения осей прилегающих профилей относительно друг друга. Используется, например, для указания величины расстояния между осевыми размерами коробки и створки. В случае прилегания створки к импосту за величину размера принимается расстояние между габаритным размером створки и осью импоста. Используется только в тех случаях если не применяются Системные константы (см. раздел Системные константы) или в случае уникального, отличного от системного размера для соединения конкретной пары профилей"
        },
        {
            "id": 158,
            "name": "Расстояние от уровня деления, мм",
            "desc": ""
        },
        {
            "id": 159,
            "name": "Расстояние узла от ручки, мм",
            "desc": ""
        },
        {
            "id": 160,
            "name": "Рассчитывать для профилей",
            "desc": "Позволяет использовать в качестве параметра тип профиля, указываемый в МЦ - с уплотнителеи и без уплотнителя. | * коэф-т|  - коэффициент для умножения количества профиля."
        }		
    ]
}