package builder.param;

import dataset.Query;
import domain.eArtikl;
import domain.eColor;
import java.text.ParseException;
import java.util.Arrays;
import java.util.List;
import javax.swing.JFormattedTextField.AbstractFormatterFactory;
import javax.swing.text.DefaultFormatterFactory;
import javax.swing.text.MaskFormatter;
import javax.swing.text.NumberFormatter;
import domain.eSetting;
import enums.Enam;
import java.util.ArrayList;

public class ParamList {

    public static Enam[] values() {
        return Ps4.values();
    }

    public static Enam find(Object grup) {
        if (grup instanceof Integer) {
                return Arrays.stream(Ps4.values()).filter(en -> en.numb() == Integer.valueOf(grup.toString())).findFirst().orElse(null);
            }
        return null;
    }
    
    public static enum Ps4 implements Enam {

        P1005(1005, "Контейнер имеет тип Артикула1/Артикула2", check_INT_LIST3), //dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071), 
        P1008(1008, "Эффективное заполнение изд., мм", check_FLOAT_LIST),
        P1010(1010, 0, "Внешнее соединение", dic_AUTO_OK_NO),
        P1011(1011, "Для Артикула 1 указан состав", check_STRING),
        P1012(1012, "Для Артикула 2 указан состав", check_STRING),
        P1013(1013, "Для Артикулов не указан состав", check_STRING),
        P1020(1020, "Ограничение угла к горизонту, °", check_FLOAT_LIST),
        P1035(1035, 0, "Уровень створки", check_FLOAT),
        P1039(1039, "Для типа открывания", dic_1039_38039_39039),
        P1040(1040, "Размер, мм", check_FLOAT),
        P1043(1043, "Ограничение габарита контура, мм", check_FLOAT),
        P1085(1085, 0, "Надпись на элементе", check_STRING),
        P1090(1090, 0, "Смещение по толщине, мм", check_FLOAT),
        P1095(1095, "Если признак системы конструкции", check_INT_LIST),
        P1097(1097, 0, "Трудозатраты по длине", dic_AUTO_OK_NO),
        P1098(1098, 0, "Бригада (участок)", dic_TEAM),
        P1099(1099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P2003(2003, "Угол варианта", dic_2003_3003),
        P2005(2005, "Контейнер имеет тип Артикула1/Артикула2", check_INT_LIST3), //dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071),
        P2012(2012, "Для Артикулов указан состав", check_STRING),
        P2013(2013, "Для Артикулов не указан состав", check_STRING),
        P2015(2015, "Ориентация Артикула1/Артикула2, °", check_FLOAT_LIST2),
        P2020(2020, "Ограничение угла, °", check_FLOAT_LIST),
        P2030(2030, "Припуск Артикула1/Артикула2 , мм", check_FLOAT_LIST2),
        P2055(2055, 0, "Продолжение общей арки", dic_AUTO_OK_NO),
        P2061(2061, 0, "Отступ для Артикула1/Артикула2, мм", check_FLOAT_LIST2),
        P2064(2064, "Поправка для состава Арт.1/Арт.2 , мм", check_FLOAT_LIST2),
        P2066(2066, 0, "Расчет углов реза профилей", dic_20066),
        P2085(2085, 0, "Надпись на элементе", check_STRING),
        P2095(2095, "Если признак системы конструкции", check_INT_LIST),
        P2097(2097, 0, "Трудозатраты по длине", dic_AUTO_OK_NO),
        P2098(2098, 0, "Бригада (участок)", dic_TEAM),
        P2099(2099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P3002(3002, "Вид L-образного варианта", dic_3002),
        P3003(3003, "Угол варианта", dic_2003_3003),
        P3005(3005, "Контейнер имеет тип Артикула1/Артикула2", check_INT_LIST3), //dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071),
        P3012(3012, "Для Артикулов указан состав", check_STRING),
        P3013(3013, "Для Артикулов не указан состав", check_STRING),
        P3015(3015, "Ориентация Артикула1/Артикула2, °", check_FLOAT_LIST2),
        P3020(3020, "Ограничение угла, °", check_FLOAT_LIST),
        //P3030(3030, "Усечение Артикула1/Артикула2, мм", check_FLOAT_LIST2), //Похоже не используют, т.к. придумали навый см.3031
        P3031(3031, "Усечение Артикула1/Артикула2, мм", check_FLOAT_LIST2),
        P3045(3045, 0, "Расстояние от уровня деления, мм", check_FLOAT),
        P3050(3050, "Припуск Артикула1/Артикула2, мм", check_FLOAT_LIST2),
        P3064(3064, "Поправка для состава Арт.1/Арт.2 , мм", check_FLOAT_LIST2),
        P3083(3083, 0, "Проходит уровень деления", dic_AUTO_OK_NO),
        P3085(3085, 0, "Надпись на элементе", check_STRING),
        P3088(3088, 0, "Вариант соединения для стойки", dic_3088),
        P3095(3095, "Если признак системы конструкции", check_INT_LIST),
        P3097(3097, 0, "Трудозатраты по длине", dic_AUTO_OK_NO),
        P3098(3098, 0, "Бригада (участок)", dic_TEAM),
        P3099(3099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P4002(4002, "Вид Т-образного варианта", dic_4002),
        P4005(4005, "Контейнер имеет тип Артикула1/Артикула2", check_INT_LIST3), //dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071),
        P4010(4010, 0, "Внешнее соединение", dic_AUTO_OK_NO),
        P4011(4011, "Для Артикула 1 указан состав", check_STRING),
        P4012(4012, "Для Артикула 2 указан состав", check_STRING),
        P4013(4013, "Для Артикулов не указан состав", check_STRING),
        P4015(4015, "Ориентация Артикула1/Артикула2, °", check_FLOAT_LIST2),
        P4018(4018, 0, "От ручки не менее, мм", check_FLOAT),
        P4020(4020, "Ограничение угла, °", check_FLOAT_LIST),
        P4040(4040, "Размер от оси профиля, мм", check_FLOAT),
        P4044(4044, "Размер от края пакета, мм", check_FLOAT),
        P4045(4045, 0, "Расстояние от уровня деления, мм", check_FLOAT),
        P4046(4046, "Длина Артикула 1, мм", check_FLOAT),
        P4050(4050, "Припуск Артикула 1, мм.", check_FLOAT),
        P4061(4061, 0, "Максимальный размер шва, мм", check_FLOAT),
        P4064(4064, 0, "Поправка для состава, мм", check_FLOAT),
        P4083(4083, 0, "Проходит уровень деления", dic_AUTO_OK_NO),
        P4085(4085, 0, "Надпись на элементе", check_STRING),
        P4095(4095, "Если признак системы конструкции", check_INT_LIST),
        P4097(4097, 0, "Трудозатраты по длине", dic_AUTO_OK_NO),
        P4098(4098, 0, "Бригада (участок)", dic_TEAM),
        P4099(4099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P7030(7030, 0, "Количество", check_FORMULA),
        P7031(7031, "Количество", check_FORMULA),
        P7040(7040, 0, "Порог расчета, мм", check_FLOAT),
        P7050(7050, 0, "Шаг, мм", check_FLOAT),
        P7060(7060, 0, "Количество на шаг", check_COUNT),
        P7078(7078, 0, "Комплект одно текстурный", dic_OK_NO),
        P7081(7081, 0, "Если ширина комплекта, мм", check_FLOAT),
        P7098(7098, 0, "Бригада (участок)", dic_TEAM),
        P7099(7099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P8050(8050, 0, "Поправка, мм", check_FLOAT),
        P8060(8060, 0, "Количество", check_COUNT),
        P8061(8061, "Количество", check_FORMULA),
        P8065(8065, 0, "Длина, мм", check_FLOAT),
        P8066(8066, "Длина, мм", check_FORMULA),
        P8070(8070, 0, "Ширина, мм", check_FLOAT),
        P8071(8071, "Ширина, мм", check_FORMULA),
        P8075(8075, "Углы реза", dic_8075),
        P8081(8081, 0, "Ширина комплекта, мм", check_FLOAT),
        P8083(8083, 0, "Набрать длину с нахлестом, мм", check_STRING),
        P8097(8097, 0, "Трудозатраты по длине", check_FLOAT),
        P8098(8098, 0, "Бригада (участок)", dic_TEAM),
        P8099(8099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P9050(9050, 0, "Поправка длины, мм", check_FLOAT),
        P9055(9055, 0, "Поправка ширины, мм", check_FLOAT),
        P9060(9060, 0, "Количество", check_COUNT),
        P9061(9061, "Количество", check_FORMULA),
        P9065(9065, 0, "Длина, мм", check_FLOAT),
        P9066(9066, "Длина, мм", check_FORMULA),
        P9070(9070, 0, "Ширина, мм", check_FLOAT),
        P9071(9071, "Ширина, мм", check_FORMULA),
        P9081(9081, 0, "Если ширина комплекта, мм", check_STRING),
        P9083(9083, 0, "Набрать длину с нахлестом/Длина , мм", check_STRING),
        P9097(9097, 0, "Трудозатраты по площади", check_FLOAT),
        P9098(9098, 0, "Бригада (участок)", dic_TEAM),
        P9099(9099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P11000(11000, "Для технологического кода контейнера (1/2)", check_FLOAT_LIST2),
        P11001(11001, "Если признак состава Арт.1", check_STRING),
        P11002(11002, "Если признак состава Арт.2", check_STRING),
        P11008(11008, "Эффективное заполнение изд., мм", check_FLOAT_LIST),
        P11005(11005, "Контейнер типа", dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071),
        P11009(11009, 0, "Внешнее соединение", dic_AUTO_OK_NO),
        P11010(11010, "Рассчитывать с Артикулом 1", dic_AUTO_OK_NO),
        P11020(11020, "Рассчитывать с Артикулом 2", dic_AUTO_OK_NO),
        P11028(11028, "Диапазон веса заполнения, кг", check_FLOAT),
        P11029(11029, 0, "Расстояние узла от ручки, мм", check_FLOAT),
        P11030(11030, "Количество", check_COUNT),
        P11040(11040, "Порог расчета, мм", check_FLOAT),
        P11050(11050, "Шаг, мм", check_FLOAT),
        P11060(11060, "Количество на шаг", check_FLOAT),
        P11066(11066, "Если текстура профиля Арт.1", dic_COLOR_NAME),
        P11067(11067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P11068(11068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P11069(11069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P11070(11070, "Ставить однократно", dic_AUTO_OK_NO),
        P11072(11072, "Расчет по стороне", dic_11072_12072),
        P11095(11095, "Если признак системы конструкции", check_INT_LIST),
        P12000(12000, "Для технологического кода контейнера (1/2)", check_FLOAT_LIST2),
        P12001(12001, "Если признак состава Арт.1", check_STRING),
        P12002(12002, "Если признак состава Арт.2", check_STRING),
        P12005(12005, "Контейнер типа", dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071),
        P12008(12008, "Эффективное заполнение изд., мм", check_FLOAT_LIST),
        P12009(12009, 0, "Внешнее соединение", dic_AUTO_OK_NO),
        P12010(12010, "Рассчитывать с Артикулом 1", dic_AUTO_OK_NO),
        P12020(12020, "Рассчитывать с Артикулом 2", dic_AUTO_OK_NO),
        P12027(12027, "Рассчитывать для профиля", dic_15027_12027),
        P12028(12028, "Диапазон веса заполнения, кг", check_FLOAT),
        P12030(12030, "[ * коэф-т ]", check_FLOAT),
        P12050(12050, "Поправка, мм", check_FLOAT),
        P12060(12060, "Количество", check_COUNT),
        P12063(12063, 0, "Углы реза по плоскости ригеля", dic_AUTO_OK_NO),
        P12064(12064, 0, "Учёт в длине углов плоскостей", dic_AUTO_OK_NO),
        P12065(12065, "Длина, мм", check_FLOAT),
        P12067(12067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P12068(12068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P12069(12069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P12070(12070, "Ставить однократно", dic_AUTO_OK_NO),
        P12072(12072, "Расчет по стороне", dic_11072_12072),
        P12075(12075, "Углы реза", dic_12075_34075_39075),
        P12095(12095, "Если признак системы конструкции", check_INT_LIST),
        P13001(13001, "Если признак состава", check_STRING),
        P13003(13003, "Тип проема", dic_13003_14005_15005_37008),
        P13005(13005, "Заполнение типа", dic_13005),
        P13014(13014, "Углы ориентации стороны, °", check_FLOAT_LIST, def_ANGL),
        P13015(13015, "Форма заполнения", dic_13015),
        P13017(13017, 0,"Код системы содержит строку", check_STRING),
        P13081(13081, 0, "Для внешнего/внутреннего угла плоскости, °", check_FLOAT_LIST2),
        P13095(13095, "Если признак системы конструкции", check_INT_LIST),
        P13097(13097, 0, "Трудозатраты по длине", dic_AUTO_OK_NO),
        P13098(13098, 0, "Бригада (участок)", dic_TEAM),
        P13099(13099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P14000(14000, "Для технологического кода контейнера", check_STRING),
        P14001(14001, "Если признак состава", check_STRING),
        P14005(14005, "Тип проема", dic_13003_14005_15005_37008),
        P14008(14008, "Эффективное заполнение изд., мм", check_FLOAT_LIST),
        P14009(14009, "Арочное заполнение", dic_AUTO_OK_NO),
        P14017(14017, 0, "Код системы содержит строку", check_STRING),
        P14030(14030, "Количество", check_COUNT),
        P14040(14040, "Порог расчета, мм"),
        P14050(14050, "Шаг, мм", check_FLOAT),
        P14060(14060, "Количество на шаг", check_FLOAT),
        P14065(14065, "Ограничение угла, °", check_FLOAT_LIST),
        P14067(14067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P14068(14068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P14069(14069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P14081(14081, "Если артикул профиля контура", dic_ARTIKL_CODE),
        P14095(14095, "Если признак системы конструкции", check_INT_LIST),
        P15000(15000, "Для технологического кода контейнера", check_STRING),
        P15001(15001, "Если признак состава", check_STRING),
        P15005(15005, "Тип проема", dic_13003_14005_15005_37008),
        P15008(15008, "Эффективное заполнение изд., мм", check_FLOAT_LIST),
        P15009(15009, "Арочное заполнение", dic_AUTO_OK_NO),
        P15011(15011, "Расчет реза штапика", dic_15011),
        P15013(15013, 0, "Подбор дистанционных вставок пролета", dic_15013),
        P15017(15017, 0, "Код системы содержит строку", check_STRING),
        P15027(15027, "Рассчитывать для профиля", dic_15027_12027),
        P15030(15030, "[ * коэф-т ]", check_FLOAT),
        P15040(15040, "Количество", check_COUNT),
        P15045(15045, "Длина, мм", check_FLOAT),
        P15050(15050, "Поправка, мм", check_FLOAT),
        P15051(15051, 0, "Удлинение на один пог.м., мм", check_FLOAT),
        P15055(15055, "Ограничение угла, °", check_FLOAT_LIST),
        P15067(15067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P15068(15068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P15069(15069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P15081(15081, "Если артикул профиля контура", dic_ARTIKL_CODE),
        P15095(15095, "Если признак системы конструкции", check_INT_LIST),
        P21001(21001, "Форма контура", dic_21001_24001_25001),
        P21004(21004, 0, "Артикул створки", dic_ARTIKL_CODE),
        P21005(21005, "Артикул заполнения по умолчанию", dic_ARTIKL_CODE),
        P21010(21010, "Ограничение длины стороны, мм", check_FLOAT_LIST),
        P21011(21011, "Ограничение длины (ручка константа), мм", check_FLOAT),
        P21012(21012, "Ограничение длины (ручка вариацион.), мм", check_FLOAT),
        P21013(21013, "Ограничение длины (ручка по середине), мм", check_FLOAT),
        P21016(21016, "Допустимое соотношение габаритов (б/м)", check_FLOAT_LIST2),
        P21037(21037, "Диапазон высоты вариационной ручки, мм", check_FLOAT),
        P21040(21040, 0, "Ограничение угла, °", check_FLOAT_LIST),
        P21050(21050, 0, "Ориентация стороны, °", dic_2015_3015_4015_39093),
        P21085(21085, 0, "Надпись на эскизе", check_STRING),
        P21088(21088, 0, "Уравнивание складных створок"),
        P24001(24001, "Форма контура", dic_21001_24001_25001),
        P24002(24002, "Если артикул створки", dic_ARTIKL_CODE),
        P24003(24003, 0, "Если артикул цоколя", dic_ARTIKL_CODE),
        P24004(24004, "Если створка прилегает к артикулу", dic_ARTIKL_CODE),
        P24005(24005, "Коды текстуры створки", check_FLOAT_LIST),
        P24006(24006, "Установить текстуру", dic_24006_38113_39113_40113),
        P24007(24007, "Коды текстуры ручки", dic_COLOR_NAME),
        P24008(24008, "Если серия створки", dic_SERIES),
        P24009(24009, "Коды текстуры подвеса", check_FLOAT_LIST),
        P24010(24010, "Номер стороны", check_INT),
        P24011(24011, 0, "Расчет по общей арке", dic_AUTO_OK_NO),
        P24012(24012, "Направление открывания", dic_24012_25012),
        P24013(24013, "Выбран авто расчет подвеса", dic_AUTO_OK_NO),
        P24017(24017, 0, "Код системы содержит строку", check_STRING),
        P24030(24030, "Количество", check_COUNT),
        P24032(24032, "Правильная полуарка", dic_AUTO_OK_NO),
        P24033(24033, "Фурнитура штульповая", dic_AUTO_OK_NO),
        P24036(24036, 0, "Номер Стороны_(X)/Стороны_(Y) набора", check_FLOAT_LIST2),
        P24037(24037, 0, "Номер стороны по параметру набора", check_STRING),
        P24038(24038, "Проверять Cторону_(L)/Cторону_(W)", check_FLOAT_LIST2),
        P24039(24039, 0, "Створка заднего плана"),
        P24040(24040, "Порог расчета, мм", check_FLOAT),
        P24050(24050, "Шаг, мм", check_FLOAT),
        P24060(24060, "Количество на шаг", check_COUNT),
        P24063(24063, "Диапазон веса, кг", check_FLOAT_LIST),
        P24064(24064, "Ограничение высоты ручки, мм", check_FLOAT),
        P24067(24067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P24068(24068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P24069(24069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P24070(24070, "Если высота ручки", dic_24070_25070),
        P24072(24072, "Ручка от низа створки, мм", check_FLOAT),
        P24073(24073, 0, "Петля от низа створки, мм", check_FLOAT),
        P24074(24074, 0, "Петля по центру стороны", dic_AUTO_OK_NO),
        P24075(24075, 0, "Петля от верха створки, мм", check_FLOAT),
        P24077(24077, 0, "Смещение замка от ручки, мм", check_FLOAT),
        P24078(24078, 0, "Замок от края профиля, мм", check_FLOAT),
        P24095(24095, "Если признак системы конструкции", check_INT_LIST),
        P24098(24098, 0, "Бригада (участок)", dic_TEAM),
        P24099(24099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P24800(24800, 0, "Код основной обработки (;)"),
        P24801(24801, 0, "Доп.основная обработка (;)"),
        P24802(24802, 0, "Код симметр. обработки (;)"),
        P24803(24803, 0, "Доп.симметр. обработка (;)"),
        P25001(25001, "Форма контура", dic_21001_24001_25001),
        P25002(25002, "Если артикул створки", dic_ARTIKL_CODE),
        P25003(25003, 0, "Если артикул цоколя", dic_ARTIKL_CODE),
        P25005(25005, "Коды текстуры створки", check_FLOAT_LIST),
        P25007(25007, "Коды текстуры ручки", check_FLOAT_LIST),
        P25008(25008, "Если серия створки", dic_SERIES),
        P25009(25009, "Коды текстуры подвеса", check_FLOAT_LIST),
        P25010(25010, "Номер стороны", check_INT),
        P25011(25011, "Расчет по общей арке", dic_AUTO_OK_NO),
        P25012(25012, "Направление открывания", dic_24012_25012),
        P25013(25013, "Укорочение от", dic_25013),
        P25017(25017, 0, "Код системы содержит строку", check_STRING),
        P25030(25030, "Укорочение, мм", check_FLOAT),
        P25032(25032, "Правильная полуарка", dic_AUTO_OK_NO),
        P25033(25033, "Фурнитура штульповая", dic_AUTO_OK_NO),
        P25035(25035, "[ * коэф-т ]", check_FLOAT),
        P25036(25036, 0, "Номер Стороны_(X)/Стороны_(Y) набора", check_FLOAT_LIST2),
        P25037(25037, 0, "Номер стороны по параметру набора", check_STRING),
        P25038(25038, "Проверять Cторону_(L)/Cторону_(W)", check_FLOAT_LIST2),
        P25040(25040, "Длина, мм", check_FLOAT),
        P25060(25060, "Количество", check_COUNT),
        P25063(25063, "Диапазон веса, кг", check_FLOAT),
        P25064(25064, "Ограничение высоты ручки, мм", check_FLOAT),
        P25067(25067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P25068(25068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P25069(25069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P25070(25070, "Если высота ручки", dic_24070_25070),
        P25072(25072, "Ручка от низа створки, мм", check_FLOAT),
        P25095(25095, "Если признак системы конструкции", check_INT_LIST),
        P25098(25098, 0, "Бригада (участок)", dic_TEAM),
        P25099(25099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P25800(25800, 0, "Код основной обработки (;)"),
        P25801(25801, 0, "Доп.основная обработка (;)"),
        P25802(25802, 0, "Код симметр. обработки (;)"),
        P25803(25803, 0, "Доп.симметр. обработка (;)"),
        P31000(31000, "Для технологического кода контейнера", check_STRING),
        P31001(31001, "Максимальное заполнение изделия, мм", check_FLOAT_LIST),
        P31002(31002, "Если профиль", dic_31002),
        P31003(31003, "Если соединенный артикул (T-обр.)", dic_ARTIKL_CODE),
        P31004(31004, "Если прилегающий артикул", dic_ARTIKL_CODE),
        P31005(31005, "Коды основной текстуры контейнера", check_FLOAT_LIST),
        P31006(31006, "Коды внутр. текстуры контейнера", check_FLOAT_LIST),
        P31007(31007, "Коды внешн. текстуры контейнера", check_FLOAT_LIST),
        P31008(31008, "Эффективное заполнение изделия, мм", check_FLOAT),
        P31011(31011, "Толщина внешнего/внутреннего заполнения, мм", check_FLOAT_LIST2),
        P31014(31014, "Заполнения одинаковой толщины", dic_AUTO_OK_NO),
        P31015(31015, 0, "Разбиение профиля по уровням", dic_AUTO_OK_NO),
        P31016(31016, 0, "Зазор_на_метр_мм/Размер терморазрыва стойки, мм", check_FLOAT_LIST2),
        P31017(31017, 0, "Код системы содержит строку", check_STRING),
        P31019(31019, "Правило подбора текстур", dic_31019),
        P31020(31020, "Ограничение угла к горизонту, °", check_FLOAT_LIST),
        P31033(31033, "Если предыдущий артикул", dic_ARTIKL_CODE),
        P31034(31034, "Если следующий артикул", dic_ARTIKL_CODE),
        P31035(31035, 0, "Уровень створки", check_FLOAT),
        P31037(31037, "Название фурнитуры содержит", check_STRING),
        P31040(31040, 0, "Поправка габарита накладки, мм", check_FLOAT),
        P31041(31041, "Ограничение длины профиля, мм", check_FLOAT),
        P31050(31050, "Контейнер имеет тип", dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071),
        P31051(31051, "Если створка фурнитуры", dic_31051),
        P31052(31052, "Поправка в спецификацию, мм", check_FLOAT),
        P31054(31054, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P31055(31055, "Коды внутр. и внешн. текстуры изд.", check_FLOAT_LIST),
        P31056(31056, "Коды внутр. или внеш. текстуры изд.", check_FLOAT_LIST),
        P31057(31057, "Внутренняя текстура равна внешней", dic_AUTO_OK_NO),
        P31060(31060, "Допустимый угол между плоскостями, °", check_FLOAT),
        P31073(31073, 0, "Отправочная марка фасада"),
        P31074(31074, 0, "На прилегающей створке"),
        P31080(31080, 0, "Сообщение-предупреждение"),
        P31081(31081, 0, "Для внешнего/внутреннего угла плоскости, °", check_FLOAT_LIST2),
        P31085(31085, 0, "Надпись на элементе", check_STRING),
        P31090(31090, "Изменение сторон покраски", dic_AUTO_OK_NO),
        P31095(31095, "Если признак системы конструкции", check_INT_LIST),
        P31097(31097, 0, "Трудозатраты по длине", dic_AUTO_OK_NO),
        P31098(31098, 0, "Бригада (участок)", dic_TEAM),
        P31099(31099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P31800(31800, 0, "Код обработки (;)"),
        P31801(31801, 0, "Доп.обработки (;)"),
        P33000(33000, "Для технологического кода контейнера", check_STRING),
        P33001(33001, "Если признак состава", check_STRING),
        P33002(33002, 0, "Расчет пролетов соединений"),
        P33003(33003, 0, "Расчет пролетов заполнений, мм", check_FLOAT),
        P33004(33004, 0, "Расчет от длины профиля стойки", dic_33004_34004),
        P33005(33005, "Коды основной текстуры контейнера", check_FLOAT_LIST),
        P33006(33006, "Коды внутр. текстуры контейнера", check_FLOAT_LIST),
        P33007(33007, "Коды внешн. текстуры контейнера", check_FLOAT_LIST),
        P33008(33008, "Эффективное заполнение изд., мм", check_FLOAT_LIST),
        P33011(33011, "Толщина внешнего/внутреннего заполнения, мм", dic_AUTO_OK_NO),
        P33017(33017, 0, "Код системы содержит строку", check_STRING),
        P33030(33030, "Количество", check_COUNT),
        P33031(33031, 0, "Расчет количества", dic_33031_34031_34061),
        P33032(33032, 0, "Периметр покраски по периметру"),
        P33033(33033, 0, "Расход по профилю", check_FLOAT),
        P33034(33034, 0, "Периметр покраски, мм", check_FLOAT_MOD),
        P33035(33035, 0, "Расход по поверхности на кв.м.", check_FLOAT_MOD),
        P33036(33036, 0, "Коэффициент расхода", check_FLOAT),
        P33040(33040, "Порог расчета, мм", check_FLOAT),
        P33050(33050, "Шаг, мм", check_FLOAT),
        P33060(33060, "Количество на шаг", check_FLOAT),
        P33062(33062, 0, "Если стойка удлинена", dic_33062_34062),
        P33063(33063, "Диапазон веса створки, кг", check_FLOAT_LIST),
        P33066(33066, "Если номер стороны в контуре", check_INT),
        P33067(33067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P33068(33068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P33069(33069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P33071(33071, "Контейнер типа", check_INT_LIST2),
        P33073(33073, 0, "Отправочная марка фасада"),
        P33074(33074, 0, "На прилегающей створке"),
        P33078(33078, "Ставить однократно", dic_AUTO_OK_NO),
        P33081(33081, 0, "Для внешнего/внутреннего угла плоскости, °", check_FLOAT_LIST2),
        P33095(33095, "Если признак системы конструкции", check_INT_LIST),
        P33099(33099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P34000(34000, "Для технологического кода контейнера", check_STRING),
        P34001(34001, "Если признак состава"),
        P34002(34002, 0, "Расчет пролетов соединений"),
        P34003(34003, "Расчет пролетов заполнений, мм"),
        P34004(34004, 0, "Расчет от длины профиля стойки", dic_33004_34004),
        P34005(34005, "Коды основной текстуры контейнера", check_FLOAT_LIST),
        P34006(34006, "Коды внутр. текстуры контейнера", check_FLOAT_LIST),
        P34007(34007, "Коды внешн. текстуры контейнера", check_FLOAT_LIST),
        P34008(34008, "Эффективное заполнение изделия, мм", check_FLOAT),
        P34009(34009, "Если два присоединенных артикула", dic_ARTIKL_CODE),
        P34010(34010, "Расчет армирования", dic_34010),
        P34011(34011, "Толщина внешнего/внутреннего заполнения, мм", check_FLOAT_LIST2),
        P34012(34012, 0, "Для варианта соединения Т (*)"),
        P34013(34013, 0, "Подбор дистанционных вставок по пролетам", dic_AUTO_OK_NO),
        P34015(34015, 0, "Расчет длины по", dic_34015),
        P34016(34016, 0, "Прилегание контура створки"),
        P34017(34017, 0, "Код системы содержит строку", check_STRING),
        P34030(34030, "[ * коэф-т ]", check_FLOAT),
        P34049(34049, 0, "Поправка по нормали от начала/конца, мм", check_FLOAT_LIST2b),
        P34051(34051, "Поправка, мм", check_FLOAT),
        P34052(34052, 0, "Поправка не прямого угла импоста, мм", check_FLOAT),
        P34060(34060, "Количество", check_COUNT),
        P34061(34061, "Расчет количества", dic_33031_34031_34061),
        P34062(34062, 0, "Если стойка удлинена", dic_33062_34062),
        P34063(34063, "Диапазон веса створки, кг", check_FLOAT_LIST),
        P34064(34064, 0, "Учёт поправок соединений для составов"),
        P34066(34066, "Если номер стороны в контуре", check_INT),
        P34067(34067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P34068(34068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P34069(34069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P34070(34070, "Длина, мм", check_FLOAT),
        P34071(34071, "Контейнер типа", check_INT_LIST2), //dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071),
        P34072(34072, 0, "Смещение от уровня деления, мм", check_FLOAT),
        P34073(34073, 0, "Отправочная марка фасада"),
        P34074(34074, 0, "На прилегающей створке"),
        P34075(34075, "Углы реза", dic_12075_34075_39075),
        P34077(34077, "Задать Угол_реза_1/Угол_реза_2, °", check_FLOAT_LIST2),
        P34078(34078, "Ставить однократно", dic_AUTO_OK_NO),
        P34079(34079, 0, "Длина подбирается из списка, мм", check_FLOAT_LIST),
        P34080(34080, 0, "Длина округляется с шагом, мм", check_FLOAT),
        P34081(34081, 0, "Для внешнего/внутреннего угла плоскости, °", check_FLOAT_LIST2),
        P34095(34095, "Если признак системы конструкции", check_INT_LIST),
        P34097(34097, 0, "Трудозатраты по длине", dic_AUTO_OK_NO),
        P34099(34099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P37001(37001, "Установка жалюзи", dic_37001),
        P37002(37002, "Если артикул профиля контура", dic_ARTIKL_CODE),
        P37005(37005, "Коды основной текстуры контейнера", check_FLOAT_LIST),
        P37006(37006, "Коды внутр. текстуры контейнера", check_FLOAT_LIST),
        P37007(37007, "Коды внешн. текстуры контейнера", check_FLOAT_LIST),
        P37008(37008, "Тип проема", dic_13003_14005_15005_37008),
        P37009(37009, "Тип заполнения", dic_37009),
        P37010(37010, "Ограничение ширины/высоты листа, мм", check_FLOAT_LIST2),
        P37017(37017, 0, "Код системы содержит строку", check_STRING),
        P37030(37030, "Ограничение площади, кв.м.", check_FLOAT_LIST),
        P37042(37042, "Допустимое соотношение габаритов (б/м)"),
        P37054(37054, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P37055(37055, "Коды внутр. и внешн. текстуры изд.", check_FLOAT_LIST),
        P37056(37056, "Коды внут. или внеш. текстуры изд.", check_FLOAT_LIST),
        P37080(37080, 0, "Сообщение-предупреждение"),
        P37085(37085, 0, "Надпись на элементе", check_STRING),
        P37095(37095, "Если признак системы конструкции", check_INT_LIST),
        P37097(37097, 0, "Трудозатраты по", dic_37097),
        P37098(37098, 0, "Бригада (участок)", dic_TEAM),
        P37099(37099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P37108(37108, 0, "Коэффициенты АКЦИИ", check_FLOAT),
        P37310(37310, 0, "Сопротивление теплопередаче, м2*°С/Вт", check_FLOAT),
        P37320(37320, 0, "Воздухопроницаемость, м3/(ч*м2)", check_FLOAT_MOD),
        P37330(37330, 0, "Звукоизоляция, дБА", check_FLOAT),
        P37340(37340, 0, "Коэффициент пропускания света", check_FLOAT),
        P37350(37350, 0, "Сопротивление ветровым нагрузкам, Па", check_FLOAT),
        P37351(37351, "Номер поверхности", check_INT),
        P38004(38004, "Расчет", dic_38004_39005),
        P38010(38010, "Номер стороны", check_INT),
        P38017(38017, 0, "Код системы содержит строку", check_STRING),
        P38030(38030, "Количество", check_COUNT),
        P38037(38037, "Название фурнитуры содержит", check_STRING),
        P38039(38039, "Для типа открывания", dic_1039_38039_39039),
        P38040(38040, "Порог расчета, мм", check_FLOAT),
        P38050(38050, "Шаг, мм", check_FLOAT),
        P38060(38060, "Количество на шаг", check_FLOAT),
        P38067(38067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P38068(38068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P38069(38069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P38081(38081, "Если артикул профиля контура", dic_ARTIKL_CODE),
        P38095(38095, "Если признак системы конструкции", check_INT_LIST),
        P38099(38099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P38108(38108, 0, "Применять коэффициенты АКЦИИ для МЦ"),
        P38109(38109, 0, "Возможное управление жалюзи"),
        P38113(38113, "Установить текстуру по", dic_24006_38113_39113_40113),
        P39002(39002, "Номер стороны", check_INT),
        P39005(39005, "Расчет", dic_38004_39005),
        P39017(39017, 0, "Код системы содержит строку", check_STRING),
        P39020(39020, "Поправка, мм", check_FLOAT),
        P39030(39030, "[ * коэф-т ]", check_FLOAT),
        P39037(39037, "Название фурнитуры содержит", check_STRING),
        P39039(39039, "Для типа открывания", dic_1039_38039_39039),
        P39060(39060, "Количество", check_COUNT),
        P39063(39063, "Округлять количество до ближайшего", dic_39063),
        P39067(39067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P39068(39068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P39069(39069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P39070(39070, "Длина, мм", check_FLOAT),
        P39075(39075, "Углы реза", dic_12075_34075_39075),
        P39077(39077, "Задать Угол_реза_1/Угол_реза_2, °", check_FLOAT_LIST2),
        P39080(39080, 0, "Шаг вагонки (ламели), мм", check_FLOAT),
        P39081(39081, "Если артикул профиля контура", dic_ARTIKL_CODE),
        P39093(39093, 0, "Поперечину ставить :", dic_2015_3015_4015_39093),
        P39095(39095, "Если признак системы конструкции", check_INT_LIST),
        P39097(39097, 0, "Трудозатраты по периметру", dic_AUTO_OK_NO),
        P39099(39099, 0, "Трудозатраты, ч/ч.", check_FLOAT),
        P39108(39108, 0, "Применять коэффициенты АКЦИИ для МЦ"),
        P39109(39109, 0, "Возможное управление жалюзи"),
        P39113(39113, "Установить текстуру по", dic_24006_38113_39113_40113),
        P40004(40004, "Ширина заполнения, мм", check_FLOAT),
        P40005(40005, 0, "Поправка ширины/высоты, мм", check_FLOAT_LIST2),
        P40006(40006, "Высота заполнения, мм", check_FLOAT),
        P40007(40007, "Высоту сделать длиной", dic_AUTO_OK_NO),
        P40008(40008, "Эффективное заполнение изд., мм", check_FLOAT_LIST),
        P40010(40010, "Поправка на стороны четные/нечетные, мм", check_FLOAT_LIST2),
        P40017(40017, 0, "Код системы содержит строку", check_STRING),
        P40037(40037, "Название фурнитуры содержит", check_STRING),
        P40067(40067, "Коды основной текстуры изделия", check_FLOAT_LIST),
        P40068(40068, "Коды внутр. текстуры изделия", check_FLOAT_LIST),
        P40069(40069, "Коды внешн. текстуры изделия", check_FLOAT_LIST),
        P40095(40095, "Если признак системы конструкции", check_INT_LIST),
        P40108(40108, 0, "Применять коэффициенты АКЦИИ для МЦ"),
        P40109(40109, 0, "Возможное управление жалюзи"),
        P40113(40113, "Установить текстуру по", dic_24006_38113_39113_40113);

        // <editor-fold defaultstate="collapsed" desc="<<Эти поля закомментировал на раннем этапе разработки, т.к. мало пояснений>>"> 
        //P4801(4801, 0, "Доп.обработки (;)"),
        // </editor-fold> 
        private int grup = 0;
        private String text = "";
        private int pass = 1;  //0-игнорировать, 1-в продакшен, 3-в разработке см. ParamTest

        public Defparam defparam = def_Default;
        public Dictionary dictionary = dic_DEFAULT;
        public Checkparam check = check_STRING;

        Ps4(int numb, String text, Object... obj) {
            this(numb, 1, text, obj);
        }

        Ps4(int numb, int pas, String text, Object... obj) {
            this.grup = numb;
            this.pass = pas;
            this.text = text;
            for (Object o : obj) {
                if (o instanceof Dictionary) {
                    this.dictionary = (Dictionary) o;
                } else if (o instanceof Checkparam) {
                    this.check = (Checkparam) o;
                } else if (o instanceof Defparam) {
                    this.defparam = (Defparam) o;
                }
            }
        }

        public int numb() {
            return grup;
        }

        public int pass() {
            return pass;
        }

        public String text() {
            return text;
        }

        public String def() {
            return defparam.def();
        }

        public List dict() {
            return dictionary.dict();
        }

        public boolean check(String c) {
            if (c == null) {
                return true;
            } else if (c.isEmpty()) {
                return true;
            } else {
                return check.check(c);
            }
        }
    }

    //Default value
    // <editor-fold defaultstate="collapsed" desc="Generated Defparam">   
    interface Defparam {

        public String def();
    }

    public static Defparam def_Default = () -> {

        return "";
    };

    public static Defparam def_NUMB = () -> {

        return "0";
    };

    public static Defparam def_LENGTH = () -> {

        return "0-1000;";
    };

    public static Defparam def_ANGL = () -> {

        return "0-360;";
    };
    // </editor-fold>  

    //Dictionary
    // <editor-fold defaultstate="collapsed" desc="Generated Dictionary"> 
    interface Dictionary {

        public List<String> dict();
    }

    public static Dictionary dic_DEFAULT = () -> {
        return null;
    };

    public static Dictionary dic_2015_3015_4015_39093 = () -> {
        return List.of("горизонтально", "вертикально");
    };

    public static Dictionary dic_38004_39005 = () -> {
        return List.of("по периметру", "по площади", "длина по коробке");
        //, "как крест", "как концевик", "для прямых углов", "для не прямых углов");
    };

    public static Dictionary dic_2003_3003 = () -> {
        return List.of("левый", "правый");
    };

    public static Dictionary dic_24012_25012 = () -> {
        return List.of("левое", "правое");
    };

    public static Dictionary dic_31002 = () -> {
        return List.of("прямой", "кривой");
    };

    public static Dictionary dic_31051 = () -> {
        return List.of("ведомая", "ведущая");
    };

    public static Dictionary dic_OK_NO = () -> {
        return List.of("Да", "Нет");
    };

    public static Dictionary dic_AUTO_OK_NO = () -> {
        return List.of("Авто", "Да", "Нет");
    };

    public static Dictionary dic_15027_12027 = () -> {
        return List.of("с уплотнителем", "без уплотнителя");
    };

    public static Dictionary dic_1005x6_2005x6_3005_4005_11005_12005_31050_33071_34071 = () -> {
        return List.of("коробка", "створка", "импост", "ригель/импост", "стойка", "стойка/коробка", "эркер", "грань");
        //return List.of("коробка", "створка", "импост", "стойка", "эркер");
    };

    public static Dictionary dic_24070_25070 = () -> {
        return List.of("по середине", "константная", "не константная", "установлена");
    };

    public static Dictionary dic_21001_24001_25001 = () -> {
        return List.of("прямоугольная", "трапециевидная", "не арочная", "арочная");
    };

    public static Dictionary dic_13015 = () -> {
        return List.of("Прямоугольное", "Не прямоугольное", "Не арочное", "Арочное");
    };

    public static Dictionary dic_37009 = () -> {
        return List.of("Все", "Произвольное", "Прямоугольное", "Арочное");
    };

    public static Dictionary dic_37005 = () -> {
        return Arrays.asList("Внутренний", "Раскладка", "Вагонка", "Жалюзи на профили", "Жалюзи на заполнение");
    };

    public static Dictionary dic_COLOR_NAME = () -> {
        //return List.of("1цвет", "2цвет", "3цвет", "4цвет");
        List list = new ArrayList();
        new Query(eColor.name).select(eColor.up, "order by", eColor.name).forEach(rec -> list.add(rec.getStr(eColor.name)));
        return list;
    };

    public static Dictionary dic_COLOR2 = () -> {
        return List.of("1цвет", "2цвет", "3цвет", "4цвет");
    };

    public static Dictionary dic_11072_12072 = () -> {
        return List.of("большей", "меньшей", "общей");
    };

    public static Dictionary dic_3088 = () -> {
        return List.of("внешний", "внутренний");
    };

    public static Dictionary dic_37001 = () -> {
        return List.of("на профили", "на заполнения");
    };

    public static Dictionary dic_20066 = () -> {
        return List.of("по меньшей ширине");
    };

    public static Dictionary dic_33031_34031_34061 = () -> {
        return List.of("по уровням деления");
    };

    public static Dictionary dic_13003_14005_15005_37008 = () -> {
        return List.of("глухой", "не глухой");
    };

    public static Dictionary dic_24006_38113_39113_40113 = () -> {
        return List.of("по текстуре ручки", "по текстуре подвеса", "по текстуре замка");
    };

    public static Dictionary dic_39063 = () -> {
        return List.of("меньшего целого числа", "большего целого числа", "большего чётного числа", "большего нечётного числа");
    };

    public static Dictionary dic_33062_34062 = () -> {
        return List.of("только вверх", "только вниз", "вверх и вниз", "нет удлинений");
    };

    public static Dictionary dic_13005 = () -> {
        return List.of("Стекло", "Стеклопакет", "Сендвич", "Вагонка", "Алюминевый лист", "Специальное стекло", "Конструктив", "Панель откоса");
    };

    public static Dictionary dic_25013 = () -> {
        return List.of("длины стороны", "высоты ручки", "сторона - выс. ручки", "половины стороны");
    };

    public static Dictionary dic_33004_34004 = () -> {
        return List.of("вычет длин удлинений", "по нижнему удлинению", "по верхнему удлинению", "по обоим удлинениям");
    };

    public static Dictionary dic_8075 = () -> {
        return List.of("90х90", "90х45", "45х90", "45х45");
    };

    public static Dictionary dic_12075_34075_39075 = () -> {
        return List.of("по контейнерам", "по биссектрисам", "установить (90° x 90°)", "установить (90° x 45°)", "установить (45° x 45°)");
    };

    public static Dictionary dic_34010 = () -> {
        return List.of("от конца  профиля", "от внутреннего угла", "от внутреннего фальца");
    };

    public static Dictionary dic_4002 = () -> {
        return List.of("Простое Т-обр.", "Крестовое †-обр.", "Сложное Y-обр.");
    };

    public static Dictionary dic_3002 = () -> {
        return List.of("Простое L-обр.", "Крестовое †-обр.");
    };

    public static Dictionary dic_SERIES = () -> {
        return List.of("sql к сериям", "sql к сериям", "sql к сериям");
    };

    public static Dictionary dic_37097 = () -> {
        return List.of("периметру", "площади");
    };

    public static Dictionary dic_15013 = () -> {
        return List.of("без/минимальный дистанционер", "с наибольшим дистанционером");
    };

    public static Dictionary dic_1039_38039_39039 = () -> {
        return List.of("фрамуга", "поворотное", "поворотно-откидное", "раздвижное");
    };

    public static Dictionary dic_34015 = () -> {
        return List.of("длине контейнера", "межосевому расстоянию");
    };

    public static Dictionary dic_TEAM = () -> {
        return List.of("sql запрос к таблице бригад", "sql запрос к таблице бригад");
    };

    public static Dictionary dic_31019 = () -> {
        return List.of("внутренняя по основной", "внешняя по основной", "внутрення по внешней", "внешняя по внутренней", "2 стороны по основной");
    };

    public static Dictionary dic_15011 = () -> {
        return List.of("по биссектрисе", "усекать нижний", "усекать боковой");
    };

    public static Dictionary dic_ARTIKL_CODE = () -> {
        List list = new ArrayList();
        new Query(eArtikl.code).select(eArtikl.up, "where", eArtikl.level1, "= 1", "and", eArtikl.level2, "= 2 order by", eArtikl.level2).forEach(rec -> list.add(rec.getStr(eArtikl.code)));
        return list;
    };
    // </editor-fold>

    //Check
    // <editor-fold defaultstate="collapsed" desc="Generated Checkparam">   
    interface Checkparam {

        public boolean check(String c);
    }

    public static Checkparam check_STRING = (c) -> {

        return true;
    };

    public static Checkparam check_FORMULA = (c) -> {

        return true;
    };

    public static Checkparam check_COUNT = (c) -> {
        return ("-0123456789,".indexOf(c) != -1);
    };

    public static Checkparam check_INT = (c) -> {
        return ("-0123456789".indexOf(c) != -1);
    };

    public static Checkparam check_INT_MOD = (c) -> {
        return ("0123456789".indexOf(c) != -1);
    };

    public static Checkparam check_INT_LIST = (c) -> {
        return ("0123456789;".indexOf(c) != -1);
    };

    public static Checkparam check_INT_LIST2 = (c) -> {
        return ("0123456789-;".indexOf(c) != -1);
    };

    public static Checkparam check_INT_LIST3 = (c) -> {
        return ("0123456789*;-/@".indexOf(c) != -1);
    };

    public static Checkparam check_FLOAT = (c) -> {
        return ("0123456789-,".indexOf(c) != -1);
    };

    public static Checkparam check_FLOAT_MOD = (c) -> {
        return ("0123456789,".indexOf(c) != -1);
    };

    public static Checkparam check_FLOAT_LIST = (c) -> {
        return ("0123456789,-;".indexOf(c) != -1);
    };

    public static Checkparam check_FLOAT_LIST2 = (c) -> {
        return ("0123456789,*;-/@".indexOf(c) != -1);
    };

    //см. 34049
    public static Checkparam check_FLOAT_LIST2b = (c) -> {
        return ("0123456789,-/".indexOf(c) != -1);
    };
    // </editor-fold>      
}
