[
	{
		"id": 1,
		"name": "Арочное заполнение",
		"desc": "Может принимать значения 'Да' и 'Нет'. Определяет применение комплектующего в случае арочного проема или НЕ арочного."
	},
	{
		"id": 2,
		"name": "Артикул заполнения по умолчанию",
		"desc": ""
	},
	{
		"id": 3,
		"name": "Артикул створки",
		"desc": "Позволяет выбрать умолчально задаваемый артикул створки на каждой из сторон створки. Не является обязательным параметром"
	},
	{
		"id": 4,
		"name": "Бригада (участок)",
		"desc": "может принимать значения, предварительно описанные в соответствующем каталоге 'Бригады'. Используется для указания, какой бригаде или отделу принадлежат человеко-часы, затраченные на выполнение данного варианта соединения. Необходимо использовать в паре с параметром 'Трудозатраты, ч/'"
	},
	{
		"id": 5,
		"name": "Вариант соединения для стойки",
		"desc": ""
	},
	{
		"id": 6,
		"name": "Вид L-образного варианта",
		"desc": "обеспечивает возможность разделения простых (сопряжение 2-х профилей) и крестовых (сопряжение 3-х) соединений для разделения их спецификаций"
	},
	{
		"id": 7,
		"name": "Вид Т-образного варианта",
		"desc": "Обеспечивает возможность разделения 'Простых' (сопряжение 2-х профилей) и 'Крестовых' (сопряжение 3-х) соединений для разделения их спецификаций, а также 'Сложных Y-образных' - для разделения прямых крестовых вариантов соединений и сложных креплений в одном узле типа 'солнышко' в арке"
	},
	{
		"id": 8,
		"name": "Внешнее соединение",
		"desc": "Служит для выбора конкретного варианта применения соединения профилей только для внешних (расположенных по периметру изделия) или только для внутренних (расположенных в теле изделия) соединений. Применяется в случае необходимости использовать конкретное соединение профилей либо по периметру, либо внутри изделия."
	},
	{
		"id": 9,
		"name": "Внутренняя текстура равна внешней",
		"desc": ""
	},
	{
		"id": 10,
		"name": "Воздухопроницаемость, м3/(ч*м2",
		"desc": ""
	},
	{
		"id": 11,
		"name": "Возможное управление жалюзи",
		"desc": ""
	},
	{
		"id": 12,
		"name": "Выбран авто расчет подвеса",
		"desc": "При указании значения 'Да' включает автоматический подбор петель по текстуре изделия. Работает только при полном совпадении текстур петель и текстур изделия"
	},	
	{
		"id": 13,
		"name": "Высота заполнения, мм",
		"desc": "Позволяет задать фиксированную высоту комплектующего"
	},
	{
		"id": 14,
		"name": "Высоту сделать длиной",
		"desc": "Позволяет учитывать высоту контура в качестве длины комплектующего"
	},
	{
		"id": 15,
		"name": "Диапазон веса створки, кг",
		"desc": "Определяет диапазон веса створки допустимый для конкретного комплектующего. Вес створки определяется по весу заполнения, рассчитанного по габаритам створки"
	},
	{
		"id": 16,
		"name": "",
		"desc": "Диапазон веса, кг  - определяет диапазон веса створки допустимый для конкретного комплектующего. Вес створки определяется по весу заполнения, рассчитанного по габаритам створки."
	},
	{
		"id": 17,
		"name": "Диапазон высоты вариационной ручки, мм",
		"desc": ""
	},
	{
		"id": 18,
		"name": "Диапазон макс. ширины откоса, мм",
		"desc": ""
	},
	{
		"id": 19,
		"name": "Диапозон веса заполнения, кг",
		"desc": ""
	},
	{
		"id": 20,
		"name": "Длина Артикула 1, мм",
		"desc": "Позволяет ограничить диапазоном значений подбор механических соединителей для вариантов 'импост-коробка' в зависимости от длины импоста"
	},
	{
		"id": 21,
		"name": "Длина округляется с шагом, мм",
		"desc": "Округление рассчитанной длины с определенным шагом. Подбирается ближайшее меньшее значение"
	},
	{
		"id": 22,
		"name": "Длина подбирается из списка, мм",
		"desc": "Для подбора длины комплектующего из списка определенного в значении параметра. Подбирается ближайшая меньшая длина из списка"
	},
	{
		"id": 23,
		"name": "Длина, мм",
		"desc": "в случае указания величины - явное задание длины комплектующего, без привязки к длине комплекта. Для корректного расчета комплектующих в нескольких комплектах, необходимо использовать формулу 'L+n', где - 'n' - поправка для точного расчета длины заготовки. - позволяет задать определенную (фиксированную) длину комплектующего, а не использовать по умолчанию длину профиля, на который устанавливается состав"
	},
	{
		"id": 24,
		"name": "Для Артикула 1 указан состав",
		"desc": "Значением является значение поля 'Наименование состава' или его часть (в каталоге Конструктив - Составы). Является проверочным для применения конкретного варианта соединения, если значение параметра для Артикула 1 (Артикула 2) действительно используется в Составах с тем же значением"
	},
	{
		"id": 25,
		"name": "Для Артикула 2 указан состав",
		"desc": "Значением является значение поля 'Наименование состава' или его часть (в каталоге Конструктив - Составы). Является проверочным для применения конкретного варианта соединения, если значение параметра для Артикула 1 (Артикула 2) действительно используется в Составах с тем же значением"
	},
	{
		"id": 26,
		"name": "Для Артикулов не указан состав",
		"desc": "Работает аналогично предыдущему параметру, но обратным образом"
	},
	{
		"id": 27,
		"name": "Для Артикулов указан состав",
		"desc": ""
	},
	{
		"id": 28,
		"name": "Для варианта соединения Т (*)",
		"desc": ""
	},
	{
		"id": 29,
		"name": "Для внешнего/внутреннего угла плоскости, °",
		"desc": "Определяет сочетания значений внешних и внутренних углов плоскостей. Символ - @ - определяет наличие зеркальной проверки. Допускается задание диапазонов значений углов"
	},	
	{
		"id": 30,
		"name": "Для технологического кода контейнера",
		"desc": "Используется для определения применимости Состава в зависимости от технологического кода контейнера. ТК определяется в МЦ"
	},
	{
		"id": 31,
		"name": "Для технологического кода контейнера (1/2)",
		"desc": "Позволяет указать технологические коды для контейнеров Артикула 1 и Артикула 2. Синтаксис строки: Z45/F58 - проверка наличия технологического кода Z45для профиля Артикула 1 и проверка наличия технологического кода F58 для профиля Артикула 2; */F58 - проверка наличия технологического кода F58 только для профиля Артикула 2"
	},
	{
		"id": 32,
		"name": "Для типа открывания",
		"desc": "Проверочный параметр со значениями: [фрамуга, поворотное, поворотно-откидное], позволяющий установить данный вариант соединения в зависимости от типа применяемой фурнитуры, створка которой входит в данное соединение"
	},
	{
		"id": 33,
		"name": "Доп.обработки (;)",
		"desc": ""
	},
	{
		"id": 34,
		"name": "Доп.основная обработка (;)",
		"desc": ""
	},
	{
		"id": 35,
		"name": "Доп.симметр. обработка (;)",
		"desc": ""
	},
	{
		"id": 36,
		"name": "Допустимое соотношение габаритов (б/м)",
		"desc": "Является проверочным параметром соотношения габаритов (большой/малый), - для использования совместно с полем 'Наценки, %'. Параметр допускает указание диапазона соотношений - например '5-18'"
	},
	{
		"id": 37,
		"name": "Допустимый угол между плоскостями, °",
		"desc": "Определяет диапазон углов между плоскостями конструкции для применения данного Состава. Допускается указание как конкретного угла, так и диапазона значений углов"
	},
	{
		"id": 38,
		"name": "Если артикул профиля контура",
		"desc": "Может принимать значение любого артикула профиля. Проверяется наличие указанного артикула в контуре створки"
	},
	{
		"id": 39,
		"name": "Если артикул профиля контура",
		"desc": "Может принимать значение любого артикула профиля. Методом выбора из выпадающего списка артикулов МЦ типа Профиль. Проверяет наличие указанного артикула в контуре в которое установлено Заполнение"
	},
	{
		"id": 40,
		"name": "Если артикул створки",
		"desc": "Проверочный параметр, позволяющий установить комплектующий, к которому относиться в случае выполнения условия параметра для профиля створки, исключая профиль цоколя"
	},	
	{
		"id": 41,
		"name": "Если артикул цоколя",
		"desc": "Проверочный параметр, позволяющий установить комплектующий, к которому относиться в случае выполнения условия параметра для профиля цоколя"
	},	
	{
		"id": 42,
		"name": "Если высота ручки",
		"desc": "Может иметь следующие значения: 'по середине' - ручка устанавливается по середине профиля створки; 'константная' - происходит проверка списка комплектующих совместно с параметром 'Ручка от низа створки, мм'; 'не константная' - запрет на применение основных запоров с константным положением ручки; 'установлена' - происходит проверка списка комплектующих совместно с параметром 'Мин. высота ручки, мм' ('Макс. высота ручки, мм')"
	},
		{
		"id": 43,
		"name": "Если два присоединенных артикула",
		"desc": "Позволяет указать 2 артикула при наличии соединения с которыми устанавливается пункт Спецификации Состава. Возможно указание с помощью интерфейса программы - выбор первого, а затем второго артикула. Или ручное указание артикулов, через точку с запятой"
	},
		{
		"id": 44,
		"name": "Если номер стороны в контуре",
		"desc": "Проверочный параметр для альтернативной настройки водосливов и подставочных профилей в непрямоугольных контурах"
	},
		{
		"id": 45,
		"name": "Если предыдущий артикул",
		"desc": "Позволяет установку состава в случае совпадения предыдущего (по ходу обхода векторов профилей изделия (против часовой стрелки)) артикула профиля с профилем, на который устанавливается состав. Параметр содержит выпадающий список артикулов профилей"
	},
		{
		"id": 46,
		"name": "Если признак системы конструкции",
		"desc": "Позволяет определить в качестве значения параметра значения полей 'Признак системы' окна 'Системы конструкци"
	},
		{
		"id": 47,
		"name": "Если признак состава",
		"desc": "Для применения элемента Спецификации при применении Состава с определенным признаком состава"
	},
		{
		"id": 48,
		"name": "Если признак состава",
		"desc": "Для применения элемента Спецификации при применении Состава с определенным признаком состава"
	},
		{
		"id": 49,
		"name": "Если признак состава Арт.1 ('Если признак состава Арт. 2')",
		"desc": "Проверяет значения поля 'Признак' у Составов профилей Артикула 1 и 2"
	},
		{
		"id": 50,
		"name": "Если признак состава Арт.2 ('Если признак состава Арт.1')",
		"desc": "Проверяет значения поля 'Признак' у Составов профилей Артикула 1 и 2"
	},
]